package student_attendance_record_ii

func CheckRecord(n int) int {
	MOD := 1000000007
	// 一维用于遍历数组, 二维记录A的数量，三维记录L的数量
	// 满足条件A的取值是0，1；满足条件的L的取值是0，1，2
	dp := make([][2][3]int, n + 1)
	// 为了简化，dp下标从1开始，对应第N个字符
	// 初始化dp方程
	dp[1][1][0] = 1
	dp[1][0][1] = 1
	dp[1][0][0] = 1
	for i := 2; i <= n; i++ {
		// +P
		dp[i][0][0] = (dp[i-1][0][0] + dp[i-1][0][1] + dp[i-1][0][2]) % MOD
		dp[i][1][0] = (dp[i-1][1][0] + dp[i-1][1][1] + dp[i-1][1][2]) % MOD
		// +L
		dp[i][0][1] = dp[i-1][0][0]
		dp[i][1][1] = dp[i-1][1][0]
		dp[i][0][2] = dp[i-1][0][1]
		dp[i][1][2] = dp[i-1][1][1]
		// +A
		// 此处的 dp[i][1][0] 在上面 +P 时已经开始出现，故此处应 +=
		dp[i][1][0] += (dp[i-1][0][0] + dp[i-1][0][1] + dp[i-1][0][2]) % MOD
	}
	return (dp[n][0][0] + dp[n][0][1] + dp[n][0][2] + dp[n][1][0] + dp[n][1][1] + dp[n][1][2]) % MOD
}
